{
    "language": {
        "flag": "united-kingdom.svg",
        "abbreviation": "EN"
    },

    "navigation": {
        "about": "About",
        "works": "Works",
        "contact": "Contact"
    },

    "header": {
        "title": "Web developer",
        "list": ["Design", "Front-End", "Back-End", "User experience (UX)"]
    },

    "about": {
        "name": "Eva Famechon",
        "job": "Web Developer",
        "bio": "I'm a passionate web developer with experience in React...",
        "cv": "Download resume",
        "cvFileName": "resume.pdf"
    },
    "skills": [
        {
            "title": "Front-end Development",
            "description": "I specialize in front-end development, creating interactive and user-friendly user interfaces.",
            "image": "frontend.png",
            "keywords": [
                "HTML",
                "CSS",
                "JavaScript",
                "React",
                "Responsive Design",
                "SEO"
            ]
        },
        {
            "title": "Back-end Web Development",
            "description": "I have knowledge in back-end web development.",
            "image": "backend.png",
            "keywords": [
                "Node.js",
                "Express.js",
                "MongoDB",
                "RESTful APIs",
                "Authentication"
            ]
        },
        {
            "title": "Design & UX/UI",
            "description": "I am passionate about user experience design, creating intuitive and easy-to-use interfaces.",
            "image": "design.png",
            "keywords": [
                "Wireframing",
                "Prototyping",
                "Interaction Design",
                "UI/UX Design",
                "User Research",
                "InDesign"
            ]
        }
    ],

    "projectsHeader": {
        "title": "My Projects",
        "allCategories": "All",
        "categories": ["Web Development", "Design", "Personal Work"]
    },

    "projects": [
        {
            "title": "Mon Vieux Grimoire",
            "subtitle": "Backend for Book Rating Website",
            "category": "Web Development",
            "image": "grimoire.jpg",
            "shortDescription": "Development of the backend for a book rating website for a local bookstore chain",
            "detailedDescription": "Mon Vieux Grimoire is a web application that allows members to add and rate books. I was responsible for creating and developing the backend of this website. My role involved setting up the RESTful API that handles book-related operations, user authentication, and review management. I used Node.js and Express.js for server-side development, along with MongoDB as the database using Mongoose as the ODM. I also implemented user authentication using JSON Web Tokens (JWT) to ensure data security. The backend provides robust features such as Create, Read, Update, and Delete (CRUD) operations for books, user management, and review validation. I worked collaboratively with a frontend developer to seamlessly integrate the frontend with the backend. The project followed best practices in data security, unique email validation, and the implementation of middlewares for request handling.",
            "technologiesUsed": [
                "Node.js",
                "Express.js",
                "MongoDB",
                "Mongoose",
                "JWT",
                "Bcrypt"
            ],
            "githubLinkTitle": "Link to project Github repository",
            "githubLink": "https://github.com/evafmh/P7-mon-vieux-grimoire-backend",
            "keywords": [
                "CRUD",
                "middleware",
                "data security",
                "authentication",
                "authorization",
                "API integration"
            ],
            "competencies": [
                "Implementation of a logical data model in compliance with regulations",
                "Secure storage of data",
                "Secure implementation of CRUD operations"
            ]
        },
        {
            "title": "Kasa - Booking Web Application",
            "subtitle": "Front-end development with React for a booking platform",
            "category": "Web Development",
            "image": "kasa.png",
            "shortDescription": "Development of the web platform for accomodation booking for the company Kasa",
            "detailedDescription": "Kasa is a company specialized in apartment rentals between individuals in France. In this project, I was tasked with developing the front-end web application for accomodation booking for Kasa using React technology. My role involved creating and developing React components, setting up routes with React Router, and following the provided mockups. I added a CSS animation to the opening/closing of the Collapse component to enhance the user experience. The project followed Kasa's coding guidelines to ensure code quality.",
            "technologiesUsed": [
                "React",
                "React Router",
                "CSS",
                "HTML",
                "JavaScript",
                "Figma"
            ],
            "githubLinkTitle": "Link to project Github repository",
            "githubLink": "https://github.com/evafmh/P6-kasa",
            "keywords": [
                "React",
                "CSS",
                "HTML",
                "JavaScript",
                "Mockup",
                "Front-end Integration"
            ],
            "competencies": [
                "Configuring navigation between application pages with React Router",
                "Using React to create interactive components",
                "Implementing CSS animations to enhance the user experience"
            ]
        },
        {
            "title": "Debugging and Optimization of a Photographer's Website",
            "subtitle": "SEO Optimization and Technical Issue Resolution",
            "category": "Web Development",
            "image": "nina.jpg",
            "shortDescription": "Optimization and debugging of a professional photographer's website",
            "detailedDescription": "In this project, I optimized the website of a professional photographer, Nina Carducci, by improving its performance and search engine optimization. I analyzed the site, reduced loading time, and fixed accessibility errors. I optimized the images without compromising their quality, improved the code, and added meta tags and Schema.org for local search engine optimization. I resolved specific issues such as faulty navigation in the gallery and incorrect filter display. I used Chrome DevTools to debug the site and prepared a detailed intervention report with performance metrics before and after optimization.",
            "technologiesUsed": [
                "Chrome DevTools",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "githubLinkTitle": "Link to project Github repository",
            "githubLink": "https://github.com/evafmh/P5_nina_carducci",
            "websiteLinkTitle": "Link to project website",
            "websiteLink": "https://evafmh.github.io/P5_nina_carducci/",
            "keywords": [
                "Performance Optimization",
                "Debugging",
                "SEO",
                "Local SEO",
                "Meta Tags",
                "Accessibility",
                "Chrome DevTools"
            ],
            "competencies": [
                "Optimizing website performance",
                "Debugging a website using Chrome DevTools",
                "Writing an intervention report to test a website"
            ]
        },
        {
            "title": "Planning of Menu Maker by Qwenta Project",
            "subtitle": "Project management, technical specifications, and technological watch",
            "category": "Web Development",
            "image": "menumaker.png",
            "shortDescription": "Planning the development of a menu website for Qwenta",
            "detailedDescription": "In this project, I planned the development of the Menu Maker application by Qwenta in collaboration with Soufiane, the Product Owner. I conducted technological watch to generate ideas and define the technical specifications of the website. I prepared a clear and convincing presentation of the technical solution, highlighting the visual specifications and the communication plan with Qwenta. I used Jira a project management tool to organize tasks and created a Kanban board to track project progress. I presented my deliverables, including the technical specifications and the planning. I also implemented a method for technological watch to stay updated with the latest advancements in the field.",
            "technologiesUsed": ["Jira", "PowerPoint"],
            "keywords": [
                "Project management",
                "Technical specifications",
                "Technological watch",
                "Planning",
                "Kanban board"
            ],
            "competencies": [
                "Utilizing a project management tool to track project progress",
                "Writing technical specifications based on functional requirements",
                "Breaking down features into tasks to prepare for development",
                "Delivering a clear presentation of the technical solution",
                "Implementing a method for technological watch"
            ]
        },
        {
            "title": "Improve Care Campaign",
            "subtitle": "Graphic Design and Marketing",
            "category": "Design",
            "image": "improvecare.png",
            "shortDescription": "Design work for the 'Improve Care' marketing campaign",
            "detailedDescription": "As part of the global marketing campaign 'Reduce hospitalization. Improve care.', I contributed to the promotion of our portfolio of implantable medical devices. My role involved graphic design work, creating infographics and icons to raise awareness of our clinical results.\n\nFor this campaign, I designed an infographic that showcases the clinical outcomes of our implantable cardiac devices. These posters effectively communicate a wealth of information in a visually engaging manner. By incorporating graphs and icons, I ensured key messages are easily understood. Furthermore, we provided a link to our marketing website where customers can access detailed clinical papers for further information.\n",
            "technologiesUsed": ["Adobe InDesign"],
            "keywords": [
                "Graphic Design",
                "Marketing",
                "Infographics",
                "Visual Communication"
            ],
            "competencies": [
                "Graphic Design",
                "Marketing Campaign",
                "Infographic Design",
                "Icon Design",
                "Data Visualization"
            ]
        },
        {
            "title": "Art Workshop Facilitator",
            "subtitle": "Volunteering to Promote Art among Individuals in Need",
            "category": "Personal Work",
            "image": "volunteering.png",
            "shortDescription": "Volunteer art workshop facilitator to promote art among individuals in need",
            "detailedDescription": "As a volunteer at Art Explora, I participated in a unique experience of co-creating artworks with other participants throughout the month of October 2022. During this period, I acted as both a facilitator and a creator, fostering connections between associations, schools, and artists. At the pre-opening weekend of Hangar Y in Meudon, France, which welcomed over 10,000 attendees, I had the opportunity to share my experience with the public by explaining and discussing the workshops. It was a fantastic opportunity to engage with the community and promote access to art and culture for all.",
            "technologiesUsed": [],
            "keywords": [
                "Volunteering",
                "Art Workshops",
                "Art Promotion",
                "Social Engagement",
                "Culture"
            ],
            "competencies": [
                "Art Workshop Facilitation",
                "Art and Culture Promotion",
                "Creating Connections",
                "Social Engagement"
            ]
        },
        {
            "title": "Painting & Drawing",
            "subtitle": "My paintings and drawings projects",
            "category": "Personal Work",
            "image": "painting.png",
            "shortDescription": "Selection of paintings and drawings capturing my perception of the world",
            "detailedDescription": "During the first COVID-19 lockdown in 2020, I rediscovered the joys of painting and drawing, and I haven't stopped since. Through my art, I love to explore the beauty of the world around us and to express my own unique vision.\n\nOn this page, you'll find a selection of my pieces, including an oil pastel drawing, a ceramic painting, and some paintings that capture the beauty of nature. I've also included detailed pencil sketches of iconic Parisian buildings like the Saint Sulpice church and the Cortot concert hall. And for a touch of whimsy, don't miss my cute digital drawing of chatty pumpkins. Take a scroll through and enjoy!",
            "technologiesUsed": ["Adobe Photoshop", "Procreate"],
            "keywords": [
                "Painting",
                "Drawing",
                "Art",
                "Sketching",
                "Digital Art"
            ],
            "competencies": [
                "Painting",
                "Drawing",
                "Artistic Expression",
                "Observational Skills",
                "Creativity"
            ]
        },
        {
            "title": "Sophie Bluel's Portfolio Website",
            "subtitle": "Create a dynamic portfolio website using JavaScript",
            "category": "Web Development",
            "image": "architecte.png",
            "shortDescription": "Created a dynamic portfolio website using JavaScript for an architect portfolio",
            "detailedDescription": "As a front-end developer, I developed architect Sophie Bluel's portfolio website. The project involved creating different sections of the website, including the presentation page, the admin login page, and a modal for uploading media. I manipulated the DOM with JavaScript to create dynamic and interactive elements, retrieved user data from forms, and handled user events. I followed the provided design from Figma and integrated back-end code to store and manage data. This project showcased my skills in JavaScript, DOM manipulation, and event handling.",
            "technologiesUsed": ["JavaScript", "HTML", "CSS", "Figma"],
            "githubLinkTitle": "Link to project Github repository",
            "githubLink": "https://github.com/evafmh/Portfolio-sophie-bluel-frontend",
            "keywords": [
                "JavaScript",
                "HTML",
                "CSS",
                "Front-end Development",
                "DOM Manipulation",
                "Event Handling"
            ],
            "competencies": [
                "Manipulated DOM elements with JavaScript",
                "Retrieved user data in JavaScript via forms",
                "Handled user events with JavaScript"
            ]
        },
        {
            "title": "Transform a design into a website with HTML & CSS",
            "subtitle": "Create a website by integrating a design using HTML and CSS",
            "category": "Web Development",
            "image": "booki-activity1.jpeg",
            "shortDescription": "Development of the Booki website interface that allows users to find accommodations and activities in the city of their choice.",
            "detailedDescription": "I integrated the website interface using HTML and CSS. I received the design mockups and images and I created the HTML structure and applied the necessary CSS styles to match the design. I ensured the website was responsive and followed the provided breakpoints for different devices. Throughout the project, I adhered to coding best practices, used semantic HTML tags, and validated the code with W3C HTML and CSS validators. The website is compatible with the latest versions of Google Chrome and Mozilla Firefox. This project showcased my skills in HTML, CSS, responsive design, and attention to detail.",
            "technologiesUsed": ["HTML", "CSS", "Figma"],
            "githubLinkTitle": "Link to project Github repository",
            "githubLink": "https://github.com/evafmh/P2-Booki",
            "websiteLinkTitle": "Link to project website",
            "websiteLink": "https://evafmh.github.io/P2-Booki/",
            "keywords": [
                "HTML",
                "CSS",
                "Web Design Integration",
                "Responsive Design",
                "Semantic HTML",
                "W3C Validation"
            ],
            "competencies": [
                "Integrating content according to a design",
                "Implementing a responsive interface"
            ]
        }
    ],

    "contact": {
        "title": "Let’s work together!",
        "linksSubtitle": "Please feel free to contact me",
        "githubLink": "https://github.com/evafmh",
        "linkedinLink": "https://linkedin.com/in/eva-famechon",
        "downloadSubtitle": "Download my resume",
        "resumeText": "Resume",
        "resumeLink": "resume.pdf",
        "formTitle": "Send me a message",
        "formTextboxes": [
            { "label": "Name", "type": "input" },
            { "label": "Email", "type": "input" },
            { "label": "Message", "type": "textarea" }
        ],
        "formSubmit": "Submit",
        "legalDisclaimer": "By submitting this contact form, you consent to the collection and use of your personal data for the purpose of contacting you. The information collected via this form will be used solely to respond to your request and follow-up with you."
    }
}
