{
    "language": {
        "flag": "united-kingdom.svg",
        "abbreviation": "EN"
    },

    "navigation": {
        "about": "About",
        "works": "Works",
        "contact": "Contact"
    },

    "header": {
        "title": "Web developer",
        "list": ["Design", "Front-End", "Back-End", "User experience (UX)"]
    },

    "about": {
        "name": "Eva Famechon",
        "job": "Web Developer",
        "bio": "I'm Eva, a frontend web developer passionate about creating visually stunning and user-friendly web experiences. \n\nAfter an 8-month training at OpenClassrooms, I transitioned from marketing to explore web development. \n\nMy love for all forms of art fuels my creativity and attention to detail.",
        "cv": "Download my resume",
        "cvFileName": "Resume-Eva-Famechon.pdf"
    },
    "skills": [
        {
            "title": "Front-end Web Development",
            "description": "I specialize in front-end development, creating interactive and user-friendly user interfaces.",
            "image": "frontend.jpeg",
            "keywords": [
                "HTML",
                "CSS",
                "Sass",
                "JavaScript",
                "React",
                "Responsive Design",
                "SEO"
            ]
        },
        {
            "title": "Back-end Web Development",
            "description": "I have a strong understanding of back-end technologies and use Node.js, RESTful APIs, and authentication mechanisms to develop robust and scalable web applications.",
            "image": "backend.webp",
            "keywords": [
                "Node.js",
                "Express.js",
                "MongoDB",
                "RESTful APIs",
                "Authentication"
            ]
        },
        {
            "title": "Design & UX/UI",
            "description": "Passionate about creating and designing user experiences, I bring an artistic touch by crafting intuitive and user-friendly interfaces.",
            "image": "design.jpg",
            "keywords": [
                "UI/UX Design",
                "User Research",
                "Wireframing",
                "Prototyping",
                "Figma",
                "Adobe InDesign",
                "Procreate"
            ]
        }
    ],

    "projectsHeader": {
        "title": "My Projects",
        "allCategories": "All",
        "categories": ["Web Development", "Design", "Personal Work"]
    },

    "projects": [
        {
            "title": "Mon Vieux Grimoire",
            "subtitle": "Backend development for a book rating website",
            "category": "Web Development",
            "image": "grimoire.jpg",
            "shortDescription": "Development of the backend for a book rating website for a local bookstore chain",
            "detailedDescription": "This project was completed as part of my training at OpenClassrooms as an educational project aimed at developing my backend development skills with Node.js and Express.js.\n\nMon Vieux Grimoire is a web application that allows members to add and rate books. I was responsible for creating and developing the backend of this site. My role involved setting up the RESTful API that handles book-related operations, user authentication, and review management. The backend offers various features such as creating, reading, updating, and deleting (CRUD) books, user management, and review validation.\n\nI used Node.js and Express.js for server-side development, along with MongoDB as the database using Mongoose. I also implemented user authentication using JSON Web Tokens (JWT) to ensure data security. The project followed best practices for data security, unique email validation, and the implementation of middlewares for request management.",
            "technologiesUsed": [
                "Node.js",
                "Express.js",
                "MongoDB",
                "Mongoose",
                "JWT",
                "Bcrypt"
            ],
            "githubLinkTitle": "Click to access the project Github repository",
            "githubLink": "https://github.com/evafmh/P7-mon-vieux-grimoire-backend",
            "keywords": [
                "CRUD",
                "Middleware",
                "Data security",
                "Authentication",
                "Authorization",
                "API integration"
            ],
            "competencies": [
                "Implementation of a logical data model in compliance with regulations",
                "Secure storage of data",
                "Secure implementation of CRUD operations"
            ]
        },
        {
            "title": "Kasa - Booking Web Application",
            "subtitle": "Front-end development with React for a booking platform",
            "category": "Web Development",
            "image": "kasa.png",
            "shortDescription": "Development of the web platform for accomodation booking for the company Kasa",
            "detailedDescription": "This project was completed as part of my training at OpenClassrooms as an educational project aimed at developing my frontend development skills with React.\n\n I developed the front-end of the web application for accomodation booking for Kasa using React technology. My role involved creating and developing React components, setting up routes with React Router, and following the provided mockups. The project followed Kasa's coding guidelines to ensure code quality.",
            "technologiesUsed": [
                "React",
                "React Router",
                "CSS",
                "HTML",
                "JavaScript",
                "Figma"
            ],
            "githubLinkTitle": "Click to access the project Github repository",
            "githubLink": "https://github.com/evafmh/P6-kasa",
            "keywords": ["JavaScript", "Mockup", "Front-end Integration"],
            "competencies": [
                "Configuring navigation between application pages with React Router",
                "Using React to create interactive components"
            ]
        },
        {
            "title": "Improve Care Campaign",
            "subtitle": "Design work for the 'Improve Care' marketing campaign",
            "category": "Design",
            "image": "improvecare.png",
            "shortDescription": "Design work for the \"Improve Care\" marketing campaign",
            "detailedDescription": "As part of the global marketing campaign \"Reduce hospitalization. Improve care.\", I contributed to the promotion of our portfolio of implantable medical devices. My role involved graphic design work, creating infographics and icons to raise awareness of our clinical results.\n\nFor this campaign, I designed an infographic that showcases the clinical outcomes of our implantable cardiac devices. These posters effectively communicate a wealth of information in a visually engaging manner. By incorporating graphs and icons, I ensured key messages are easily understood. Furthermore, we provided a link to our marketing website where customers can access detailed clinical papers for further information.\n",
            "technologiesUsed": ["Adobe InDesign"],
            "websiteLinkTitle": "Click to access the website",
            "websiteLink": "https://microport.com/healthcare-professional/cardiac-rhythm-management-home-page/cardiac-rhythm-management/safer",
            "keywords": [
                "Graphic Design",
                "Marketing Campaign",
                "Infographics",
                "Data Visualization"
            ],
            "competencies": [
                "Created infographics to highlight clinical results.",
                "Executed graphic design work for the \"Improve Care\" campaign"
            ]
        },
        {
            "title": "Art Workshop Facilitator",
            "subtitle": "Volunteering to promote art among individuals in need",
            "category": "Personal Work",
            "image": "volunteering.png",
            "shortDescription": "Volunteer art workshop facilitator to promote art among individuals in need",
            "detailedDescription": "As a volunteer at Art Explora, I participated in a unique experience of co-creating artworks with other participants throughout the month of October 2022. During this period, I acted as both a facilitator and a creator, fostering connections between associations, schools, and artists from around the world.\n\n During the pre-opening weekend of Hangar Y in Meudon, France, which attracted over 10,000 visitors, I had the opportunity to share my experience with the public, explaining and discussing about the workshops. It was a fantastic opportunity to engage with the community and promote access to art and culture for all.",
            "technologiesUsed": ["PowerPoint"],
            "websiteLinkTitle": "Click to know more",
            "websiteLink": "https://evafamechon.myportfolio.com/volunteering",
            "keywords": [
                "Volunteering",
                "Art Workshops",
                "Art Promotion",
                "Social Engagement",
                "Culture"
            ],
            "competencies": [
                "Facilitated art workshops",
                "Promoted art and culture",
                "Created connections",
                "Social engagement"
            ]
        },
        {
            "title": "Debugging and Optimization of a Photographer's Website",
            "subtitle": "SEO optimization and debugging",
            "category": "Web Development",
            "image": "nina.jpg",
            "shortDescription": "Optimization and debugging of a professional photographer's website",
            "detailedDescription": "This project was completed as part of my training at OpenClassrooms as an educational project aimed at developing my skills in SEO. \n\n In this project, I optimized the website of a professional photographer by improving its performance and search engine optimization. I analyzed the site, reduced loading time, and fixed accessibility errors. I optimized the images without compromising their quality, improved the code, and added meta tags and Schema.org for local search engine optimization. \n\n I resolved specific issues such as faulty navigation in the gallery and incorrect filter display. I used Chrome DevTools to debug the site and prepared a detailed intervention report with performance metrics before and after optimization.",
            "technologiesUsed": [
                "Chrome DevTools",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "githubLinkTitle": "Click to access the project Github repository",
            "githubLink": "https://github.com/evafmh/P5_nina_carducci",
            "websiteLinkTitle": "Click to access the project website",
            "websiteLink": "https://evafmh.github.io/P5_nina_carducci/",
            "keywords": [
                "Performance Optimization",
                "Debugging",
                "SEO",
                "Local SEO",
                "Meta Tags",
                "Accessibility",
                "Chrome DevTools"
            ],
            "competencies": [
                "Optimizing website performance",
                "Debugging a website using Chrome DevTools",
                "Improving local SEO for better visibility",
                "Writing an intervention report to test a website"
            ]
        },
        {
            "title": "Painting & Drawing",
            "subtitle": "My paintings and drawings projects",
            "category": "Personal Work",
            "image": "painting.png",
            "shortDescription": "Selection of paintings and drawings capturing my perception of the world",
            "detailedDescription": "During the first COVID-19 lockdown in 2020, I rediscovered the joys of painting and drawing, and I haven't stopped since. My creativity allows me to explore the beauty of the world and bring my personal vision to life.\n\nYou can find a selection of my creations, including an oil pastel drawing, a ceramic painting, and some paintings that capture the beauty of nature. I have also included pencil sketches of iconic Parisian buildings such as the Saint-Sulpice church and the Cortot concert hall. And for a bit of fun, don't miss my cute drawing of chatty pumpkins.",
            "technologiesUsed": ["Adobe Photoshop", "Procreate"],
            "websiteLinkTitle": "Click to see more",
            "websiteLink": "https://evafamechon.myportfolio.com/painting-drawing",
            "keywords": [
                "Painting",
                "Drawing",
                "Art",
                "Sketching",
                "Digital Art",
                "Creativity"
            ],
            "competencies": [
                "Created sketches of iconic Parisian buildings",
                "Practiced painting and drawing",
                "Used digital tools like Adobe Photoshop and Procreate to create digital artworks"
            ]
        },
        {
            "title": "Sophie Bluel's Portfolio Website",
            "subtitle": "Create a dynamic portfolio website using JavaScript",
            "category": "Web Development",
            "image": "architecte.png",
            "shortDescription": "Creation of a dynamic website using JavaScript and DOM manipulation",
            "detailedDescription": "This project was completed as part of my training at OpenClassrooms as an educational project aimed at developing my front-end development skills with JavaScript.\n\nI created the portfolio website for an architect. The project involved building different sections of the website, including the homepage, the admin login page, and a modal for media downloads.\n\nI manipulated the DOM with JavaScript to create dynamic and interactive elements, retrieved user data from forms, and handled user events. I followed the provided design from Figma and integrated backend code to store and manage data.",
            "technologiesUsed": ["JavaScript", "HTML", "CSS", "Figma"],
            "githubLinkTitle": "Click to access the project Github repository",
            "githubLink": "https://github.com/evafmh/Portfolio-sophie-bluel-frontend",
            "keywords": [
                "JavaScript",
                "Front-end Development",
                "DOM Manipulation",
                "Event Handling"
            ],
            "competencies": [
                "Manipulated DOM elements with JavaScript",
                "Retrieved user data in JavaScript via forms",
                "Handled user events with JavaScript"
            ]
        },
        {
            "title": "Transform a design into a website with HTML & CSS",
            "subtitle": "Create a website by integrating a design using HTML and CSS",
            "category": "Web Development",
            "image": "booki.png",
            "shortDescription": "Development of the Booki website interface that allows users to find accommodations and activities in the city of their choice.",
            "detailedDescription": "This project was completed as part of my training at OpenClassrooms as an educational project aimed at developing my front-end development skills with HTML and CSS.\n\nI integrated the website's interface based on the provided mockups and images. I ensured that the website is responsive and follows the provided breakpoints for different devices.\n\nThroughout the project, I followed coding best practices, used semantic HTML tags, and validated the code with W3C's HTML and CSS validators. The website is compatible with the latest versions of Google Chrome and Mozilla Firefox.",
            "technologiesUsed": ["HTML", "CSS", "Figma"],
            "githubLinkTitle": "Click to access the project Github repository",
            "githubLink": "https://github.com/evafmh/P2-Booki",
            "websiteLinkTitle": "Click to access the project website",
            "websiteLink": "https://evafmh.github.io/P2-Booki/",
            "keywords": [
                "Web Design Integration",
                "Responsive Design",
                "Semantic HTML",
                "W3C Validation"
            ],
            "competencies": [
                "Integrating content according to a mockup",
                "Implementing a responsive interface"
            ]
        },
        {
            "title": "Planning of Menu Maker by Qwenta Project",
            "subtitle": "Project management, technical specifications, and technological watch",
            "category": "Web Development",
            "image": "menumaker.png",
            "shortDescription": "Planning the development of a menu website for Qwenta",
            "detailedDescription": "This project was completed as part of my training at OpenClassrooms as an educational project aimed at developing my project management skills.\n\nIn this project, I conducted technological research to generate ideas and define the technical specifications for the MenuMaker website by Qwenta. Employing the agile approach, I managed the planning through iterative sprints, organizing tasks using the Jira project management tool, and tracking the project's progress with a Kanban board.\n\nI also presented all these documents, including the technical specifications, planning, and the communication plan with Qwenta.",
            "technologiesUsed": ["Jira", "PowerPoint"],
            "keywords": [
                "Project management",
                "Technical specifications",
                "Technological watch",
                "Planning",
                "Kanban board"
            ],
            "competencies": [
                "Utilizing a project management tool",
                "Writing technical specifications based on functional requirements",
                "Breaking down features into tasks to prepare for development"
            ]
        }
    ],

    "contact": {
        "title": "Let’s work together!",
        "linksSubtitle": "Please feel free to contact me",
        "githubLink": "https://github.com/evafmh",
        "linkedinLink": "https://linkedin.com/in/eva-famechon",
        "downloadSubtitle": "Download my resume",
        "resumeText": "My resume",
        "resumeLink": "Resume-Eva-Famechon.pdf",
        "formTitle": "Send me a message",
        "formTextboxes": [
            { "id": "name", "label": "Name", "type": "input" },
            { "id": "email", "label": "Email", "type": "input" },
            { "id": "message", "label": "Message", "type": "textarea" }
        ],
        "formSubmit": "Submit",
        "formSubmitWaiting": "Sending in progress...",
        "formSubmitInputsError": "Please check your inputs and ensure that all fields are filled correctly.",
        "formSubmitSuccess": "Thank you for sending your message!\n\nI have received your email and will get back to you promptly.",
        "formSubmitError": "Sorry, an error occurred while sending the email. Please try again.",
        "legalDisclaimer": "By submitting this contact form, you consent to the collection and use of your personal data for the purpose of contacting you. The information collected via this form will be used solely to respond to your request and follow-up with you."
    }
}
