{
    "language": {
        "flag": "france.svg",
        "abbreviation": "FR"
    },

    "navigation": {
        "about": "À propos",
        "works": "Projets",
        "contact": "Contact"
    },

    "header": {
        "title": "Développeuse Web",
        "list": [
            "Design",
            "Front-End",
            "Back-End",
            "Expérience utilisateur (UX)"
        ]
    },

    "about": {
        "name": "Eva Famechon",
        "job": "Développeuse Web",
        "bio": "Je suis Eva, développeuse web frontend passionnée par la création d'expériences web convaincantes et conviviales.\n\n Ancienne chef de produit marketing, j'ai choisi de me consacrer au développement web après une formation de 8 mois chez OpenClassrooms. \n\n Ma créativité et mon souci du détail sont nourris par ma passion pour l'art sous toutes ses formes, de la peinture à la musique.",
        "cv": "Téléchargez mon CV",
        "cvFileName": "CV-Eva-Famechon.pdf"
    },

    "skills": [
        {
            "title": "Développement Web Front-end",
            "description": "Je suis spécialisée dans le développement front-end, créant des interfaces utilisateur interactives et conviviales.",
            "image": "frontend.jpeg",
            "keywords": [
                "HTML",
                "CSS",
                "Sass",
                "JavaScript",
                "React",
                "Responsive Design",
                "SEO"
            ]
        },
        {
            "title": "Développement Web Back-end",
            "description": "J'ai une solide compréhension des technologies back-end et j'utilise Node.js, des RESTful APIs et des mécanismes d'authentification pour développer des applications web robustes et évolutives.",
            "image": "backend.webp",
            "keywords": [
                "Node.js",
                "Express.js",
                "MongoDB",
                "RESTful APIs",
                "Authentification"
            ]
        },
        {
            "title": "Design & UI/UX",
            "description": "Passionnée par la création et la conception d'expérience utilisateur, j'apporte une touche artistique en concevant des interfaces intuitives et faciles à utiliser.",
            "image": "design.jpg",
            "keywords": [
                "UI/UX Design",
                "User Research",
                "Wireframing",
                "Prototypage",
                "Figma",
                "Adobe InDesign",
                "Procreate"
            ]
        }
    ],

    "projectsHeader": {
        "title": "Mes Projets",
        "allCategories": "Tous",
        "categories": ["Développement Web", "Design", "Travaux Personnels"]
    },

    "projects": [
        {
            "title": "Mon Vieux Grimoire",
            "subtitle": "Développement back-end d'un site de notation de livres",
            "category": "Développement Web",
            "image": "grimoire.jpg",
            "shortDescription": "Développement du backend d'un site de notation de livres pour une chaîne de librairies",
            "detailedDescription": "Ce projet a été réalisé dans le cadre de ma formation chez OpenClassrooms en tant que projet pédagogique visant à développer mes compétences en développement backend avec Node.js et Express.js.\n\n Mon Vieux Grimoire est une application web qui permet aux membres d'ajouter et de noter des livres. J'ai été chargé de la création et du développement du backend de ce site. Mon rôle consistait à mettre en place l'API RESTful qui gère les opérations liées aux livres, l'authentification des utilisateurs et la gestion des avis. Le backend offre différentes fonctionnalités telles que la création, la lecture, la mise à jour et la suppression (CRUD) des livres, la gestion des utilisateurs et la validation des avis. \n\n J'ai utilisé Node.js et Express.js pour le développement côté serveur, ainsi que MongoDB comme base de données en utilisant Mongoose. J'ai également mis en œuvre l'authentification des utilisateurs à l'aide de JSON Web Tokens (JWT) pour assurer la sécurité des données. Le projet a suivi les meilleures pratiques en matière de sécurité des données, de validation d'emails uniques et de mise en place de middlewares pour la gestion des requêtes.",
            "technologiesUsed": [
                "Node.js",
                "Express.js",
                "MongoDB",
                "Mongoose",
                "JWT",
                "Bcrypt"
            ],
            "githubLinkTitle": "Cliquez pour accéder au repo Github du projet",
            "githubLink": "https://github.com/evafmh/P7-mon-vieux-grimoire-backend",
            "keywords": [
                "CRUD",
                "Middleware",
                "Sécurité des données",
                "Authentification",
                "Autorisation",
                "Intégration d'API"
            ],
            "competencies": [
                "Mise en place d'un modèle logique de données",
                "Stockage sécurisé des données",
                "Implémentation sécurisée des opérations CRUD"
            ]
        },
        {
            "title": "Kasa - Application web de location immobilière",
            "subtitle": "Développement front-end avec React d'une plateforme de location",
            "category": "Développement Web",
            "image": "kasa.png",
            "shortDescription": "Développement de la plateforme web de location immobilière pour l'entreprise Kasa",
            "detailedDescription": "Ce projet a été réalisé dans le cadre de ma formation chez OpenClassrooms en tant que projet pédagogique visant à développer mes compétences en développement front-end React.\n\n J'ai développé le front-end de l'application web de location immobilière pour Kasa en utilisant la technologie React. Mon rôle a consisté à créer et développer les composants React, mettre en place les routes avec React Router, et suivre les maquettes fournies. Le projet a suivi les guidelines de codage de Kasa pour assurer la qualité du code.",
            "technologiesUsed": [
                "React",
                "React Router",
                "CSS",
                "HTML",
                "JavaScript",
                "Figma"
            ],
            "githubLinkTitle": "Cliquez pour accéder au repo Github du projet",
            "githubLink": "https://github.com/evafmh/P6-kasa",
            "keywords": ["JavaScript", "Maquette", "Intégration front-end"],
            "competencies": [
                "Configuration de la navigation entre les pages de l'application avec React Router",
                "Utilisation de React pour créer des composants interactifs"
            ]
        },
        {
            "title": "Campagne \"Improve care\"",
            "subtitle": "Travail de design pour la campagne marketing \"Improve care\"",
            "category": "Design",
            "image": "improvecare.png",
            "shortDescription": "Travail de design pour la campagne marketing \"Improve care\"",
            "detailedDescription": "Dans le cadre de la campagne mondiale de marketing \"Réduire les hospitalisations. Améliorer les soins.\", j'ai contribué à la promotion de notre portefeuille de dispositifs médicaux implantables. Mon rôle a impliqué un travail de design graphique, créant des infographies et des icônes pour sensibiliser aux résultats cliniques.\n\nPour cette campagne, j'ai conçu une infographie mettant en évidence les résultats cliniques de nos dispositifs cardiaques implantables. Ces affiches communiquent efficacement une grande quantité d'informations de manière visuellement attrayante. En incorporant des graphiques et des icônes, j'ai veillé à ce que les messages clés soient facilement compréhensibles. De plus, nous avons fourni un lien vers notre site web de marketing où les clients peuvent accéder à des articles cliniques détaillés pour plus d'informations.\n",
            "technologiesUsed": ["Adobe InDesign"],
            "websiteLinkTitle": "Cliquez pour accéder au site web",
            "websiteLink": "https://microport.com/healthcare-professional/cardiac-rhythm-management-home-page/cardiac-rhythm-management/safer",
            "keywords": [
                "Design Graphique",
                "Campagne Marketing",
                "Infographies",
                "Visualisation de Données"
            ],
            "competencies": [
                "Création d'infographies pour mettre en évidence des résultats cliniques",
                "Réalisation de travaux graphiques pour la campagne \"Improve Care\""
            ]
        },
        {
            "title": "Facilitatrice d'ateliers d'art",
            "subtitle": "Bénévolat pour promouvoir l'art auprès des personnes en difficultés",
            "category": "Travaux Personnels",
            "image": "volunteering.png",
            "shortDescription": "Facilitatrice d'ateliers d'art bénévole pour promouvoir l'art auprès des personnes en difficultés",
            "detailedDescription": "En tant que bénévole chez Art Explora, j'ai participé à une expérience unique de co-création d'œuvres d'art avec d'autres participants tout au long du mois d'octobre 2022. J'ai joué un double rôle en tant que facilitateur et créateur, en établissant des liens entre les associations, les écoles et les artistes venus du monde entier. \n\n Lors du week-end de préouverture de Hangar Y à Meudon, en France, qui a attiré plus de 10 000 visiteurs, j'ai eu l'opportunité de partager mon expérience avec le public, en expliquant et en échangeant sur les ateliers. J'ai pu m'engager avec la communauté et promouvoir l'accès à l'art et à la culture pour tous.",
            "technologiesUsed": ["PowerPoint"],
            "websiteLinkTitle": "Cliquez pour en savoir plus",
            "websiteLink": "https://evafamechon.myportfolio.com/volunteering",
            "keywords": [
                "Bénévolat",
                "Ateliers d'Art",
                "Promotion de l'Art",
                "Engagement Social",
                "Culture"
            ],
            "competencies": [
                "Animation d'ateliers d'art",
                "Promotion de l'art et de la culture",
                "Création de connexions",
                "Engagement social"
            ]
        },
        {
            "title": "Débogage et optimisation d'un site de photographe",
            "subtitle": "Optimisation SEO  et débogage d'un site web",
            "category": "Développement Web",
            "image": "nina.jpg",
            "shortDescription": "Optimisation et débogage d'un site web pour une photographe professionnelle",
            "detailedDescription": "Ce projet a été réalisé dans le cadre de ma formation chez OpenClassrooms en tant que projet pédagogique visant à développer mes compétences en SEO.\n\n Dans ce projet, j'ai optimisé le site web d'une photographe professionnelle en améliorant ses performances et son référencement. J'ai analysé le site, réduit le temps de chargement et corrigé les erreurs d'accessibilité. J'ai optimisé les images sans compromettre leur qualité, amélioré le code et ajouté des balises méta et Schema.org pour le référencement local. \n\n J'ai résolu des problèmes spécifiques tels que la navigation défectueuse dans la galerie et l'affichage incorrect des filtres. J'ai utilisé les Chrome DevTools pour débugger le site et réalisé un rapport d'intervention détaillé avec les performances avant et après l'optimisation.",
            "technologiesUsed": [
                "Chrome DevTools",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "githubLinkTitle": "Cliquez pour accéder au repo Github du projet",
            "githubLink": "https://github.com/evafmh/P5_nina_carducci",
            "websiteLinkTitle": "Cliquez pour accéder au site web du projet",
            "websiteLink": "https://evafmh.github.io/P5_nina_carducci/",
            "keywords": [
                "Optimisation des performances",
                "Débuggage",
                "SEO",
                "Référencement local",
                "Balises méta",
                "Accessibilité",
                "Chrome DevTools"
            ],
            "competencies": [
                "Optimisation des performances d'un site web",
                "Débogage d'un site web avec les Chrome DevTools",
                "Amélioration du référencement local d'un site pour une meilleure visibilité",
                "Rédaction d'un rapport d'intervention pour tester un site"
            ]
        },
        {
            "title": "Peinture et Dessin",
            "subtitle": "Mes travaux de peinture et dessin",
            "category": "Travaux Personnels",
            "image": "painting.png",
            "shortDescription": "Sélection de peintures et de dessins capturant ma perception du monde",
            "detailedDescription": "Pendant le premier confinement dû au COVID-19 en 2020, j'ai redécouvert les joies de la peinture et du dessin, et je n'ai pas arrêté depuis. Ma créativité me permet d'explorer la beauté du monde et de donner vie à ma vision personnelle.\n\n Vous pouvez trouver une sélection de mes créations. Il y a un dessin aux pastels à l'huile, une peinture sur céramique et plusieurs tableaux capturant la beauté de la nature. J'ai également inclus des croquis au crayon de bâtiments emblématiques parisiens tels que l'église Saint-Sulpice et la salle de concert Cortot. Et pour un peu de fun, ne râtez pas mon dessin mignon des citrouilles commères.",
            "technologiesUsed": ["Adobe Photoshop", "Procreate"],
            "websiteLinkTitle": "Cliquez pour voir davantage",
            "websiteLink": "https://evafamechon.myportfolio.com/painting-drawing",
            "keywords": [
                "Peinture",
                "Dessin",
                "Art",
                "Croquis",
                "Art Numérique",
                "Créativité"
            ],
            "competencies": [
                "Réalisation d'esquisses de célèbres bâtiments parisiens",
                "Pratique de la peinture et du dessin",
                "Utilisation d'outils numériques tels qu'Adobe Photoshop et Procreate pour créer des œuvres numériques"
            ]
        },
        {
            "title": "Site Portfolio de Sophie Bluel",
            "subtitle": "Création d'un site portfolio dynamique avec JavaScript",
            "category": "Développement Web",
            "image": "architecte.png",
            "shortDescription": "Création d'un site dynamique en utilisant JavaScript et mainpulation du DOM",
            "detailedDescription": "Ce projet a été réalisé dans le cadre de ma formation chez OpenClassrooms en tant que projet pédagogique visant à développer mes compétences en développement front-end avec JavaScript.\n\nJ'ai réalisé le site portfolio d'une architecte. Le projet a impliqué la création de différentes sections du site, notamment la page de présentation, la page de connexion administrateur et une modale pour télécharger des médias. \n\nJ'ai manipulé le DOM avec JavaScript pour créer des éléments dynamiques et interactifs, récupéré les données utilisateur à partir de formulaires et géré les événements utilisateurs. J'ai suivi le design fourni dans Figma et intégré du code back-end pour stocker et gérer les données.",
            "technologiesUsed": ["JavaScript", "HTML", "CSS", "Figma"],
            "githubLinkTitle": "Cliquez pour accéder au repo Github du projet",
            "githubLink": "https://github.com/evafmh/Portfolio-sophie-bluel-frontend",
            "keywords": [
                "JavaScript",
                "Développement Front-end",
                "Manipulation du DOM",
                "Gestion des événements"
            ],
            "competencies": [
                "Manipulation des éléments du DOM avec JavaScript",
                "Récupération des données utilisateurs en JavaScript via des formulaires",
                "Gestion des événements utilisateurs avec JavaScript"
            ]
        },
        {
            "title": "Transformer une maquette en site web avec HTML et CSS",
            "subtitle": "Création d'un site web en intégrant une maquette en utilisant HTML et CSS",
            "category": "Développement Web",
            "image": "booki.png",
            "shortDescription": "Développement de l'interface du site Booki qui permettra aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
            "detailedDescription": "Ce projet a été réalisé dans le cadre de ma formation chez OpenClassrooms en tant que projet pédagogique visant à développer mes compétences en développement front-end avec HTML et CSS.\n\nJ'ai intégré l'interface du site web à partir des maquettes et des images reçues. J'ai veillé à ce que le site web soit responsive et respecte les points de rupture fournis pour les différents appareils.\n\nTout au long du projet, j'ai suivi les bonnes pratiques de codage, utilisé des balises HTML sémantiques et validé le code avec les validateurs HTML et CSS du W3C. Le site web est compatible avec les dernières versions de Google Chrome et Mozilla Firefox.",
            "technologiesUsed": ["HTML", "CSS", "Figma"],
            "githubLinkTitle": "Cliquez pour accéder au repo Github du projet",
            "githubLink": "https://github.com/evafmh/P2-Booki",
            "websiteLinkTitle": "Cliquez pour accéder au site web du projet",
            "websiteLink": "https://evafmh.github.io/P2-Booki/",
            "keywords": [
                "Intégration de Design Web",
                "Design Responsive",
                "HTML Sémantique",
                "Validation W3C"
            ],
            "competencies": [
                "Intégration du contenu conformément à une maquette",
                "Implémentation d'une interface responsive"
            ]
        },

        {
            "title": "Planification du projet Menu Maker by Qwenta",
            "subtitle": "Gestion de projet, spécifications techniques et veille technologique",
            "category": "Développement Web",
            "image": "menumaker.png",
            "shortDescription": "Planification du développement d'un site de menu pour Qwenta",
            "detailedDescription": "Ce projet a été réalisé dans le cadre de ma formation chez OpenClassrooms en tant que projet pédagogique visant à développer mes compétences en gestion de projet.\n\nDans ce projet, j'ai réalisé une veille technologique pour générer des idées et définir les spécifications techniques du site MenuMaker by Qwenta. En utilisant la méthode agile, j'ai géré le planning en forme de sprint, organisant les tâches avec l'outil de gestion de projet Jira et suivant l'avancement du projet à l'aide d'un tableau Kanban.\n\nJ'ai ensuite présenté tous ces documents, y compris les spécifications techniques et la planification ainsi que le plan de ocmmunicaiton avec Qwenta.",
            "technologiesUsed": ["Jira", "PowerPoint", "Mira"],
            "keywords": [
                "Gestion de projet",
                "Spécifications techniques",
                "Veille technologique",
                "Planification",
                "Tableau Kanban"
            ],
            "competencies": [
                "Utilisation d'un outil de gestion de projet",
                "Rédaction de spécifications techniques à partir des besoins fonctionnels",
                "Décomposition des fonctionnalités en tâches pour préparer le développement"
            ]
        }
    ],

    "contact": {
        "title": "Travaillons ensemble !",
        "linksSubtitle": "N'hésitez pas à me contacter",
        "githubLink": "https://github.com/evafmh",
        "linkedinLink": "https://linkedin.com/in/eva-famechon",
        "downloadSubtitle": "Téléchargez mon CV",
        "resumeText": "Mon CV",
        "resumeLink": "CV-Eva-Famechon.pdf",
        "formTitle": "Envoyez moi un message",
        "formTextboxes": [
            { "label": "Nom", "type": "input" },
            { "label": "Email", "type": "input" },
            { "label": "Message", "type": "textarea" }
        ],
        "formSubmit": "Envoyer",
        "legalDisclaimer": "En soumettant ce formulaire de contact, vous consentez à la collecte et à l'utilisation de vos données personnelles aux fins de recontact. Les informations collectées via ce formulaire seront utilisées uniquement dans le but de répondre à votre demande et de vous recontacter."
    }
}
